src/main/java/learnSoap/wsdl/Wsdl/getCoDDetail.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:pre1="http://soprabanking.com/amplitude/savings/certificateOfDeposit"
xmlns:preAmp="http://soprabanking.com/amplitude"
targetNamespace="http://soprabanking.com/amplitude"
name="getCoDDetail">

	<wsdl:types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://soprabanking.com/amplitude/savings/certificateOfDeposit" schemaLocation="../FlowDescription/getCoDDetail.xsd"/>
		</xsd:schema>
	</wsdl:types>

	<wsdl:message name="getCoDDetailRequestFlow">
		<wsdl:part name="getCoDDetailRequestFlow" element="pre1:getCoDDetailRequestFlow"/>
	</wsdl:message>

	<wsdl:message name="getCoDDetailResponseFlow">
		<wsdl:part name="getCoDDetailResponseFlow" element="pre1:getCoDDetailResponseFlow"/>
	</wsdl:message>

	<wsdl:portType name="getCoDDetail">
		<wsdl:operation name="getCoDDetail">
			<wsdl:input message="preAmp:getCoDDetailRequestFlow" name="getCoDDetailRequestFlow"/>
			<wsdl:output message="preAmp:getCoDDetailResponseFlow" name="getCoDDetailResponseFlow"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="getCoDDetail-binding" type="preAmp:getCoDDetail">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="getCoDDetail">
			<soap:operation soapAction="getCoDDetail"/>
			<wsdl:input name="getCoDDetailRequestFlow">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="getCoDDetailResponseFlow">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="getCoDDetail">
		<wsdl:port binding="preAmp:getCoDDetail-binding" name="getCoDDetail">
			<soap:address location="http://localhost:8080/getCoDDetail"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>